УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтакнаяИнформацияПартнераАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартОсновнойМенеджерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартДилерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перепродавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="431ea12d-0bcd-44da-8c13-8fd3e3e1a591">
    <name>смартДилерБывший</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d8288f2-9450-4c32-b3b2-af0cc494cf90">
    <name>смартКлючевойКлиентПоРасходнымМатериалам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОборудованиеКлиентов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартНаименованиеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартОборудованиеКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартЧернилаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартЧернилаКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a039b99d-5c3e-46bf-b321-17891d574d3e">
    <name>смартВидыДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b5fe9406-a0b5-49eb-9e30-99dd19a7a18b">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c9650fb8-3e0f-4ca1-b198-3b3d9b8f018c">
    <name>смартТипичноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="082a786c-a92a-457f-bce6-eb2074d564f5">
      <name>ТипичноеОборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/CommonModules/CRM_МетодыФормДокументовСервер/Module.bsl
#Область ПеренесеноСДоорабооткамиСмарт

&ИзменениеИКонтроль("ЗаполнитьГруппуИнтересаВФормеПрочихДокументов")
//++ #1926 смарт: Фролов 16.07.2024 //Запрет подставления незавершенного интереса при создании/копировании Заказа клиента
Процедура смарт_ЗаполнитьГруппуИнтересаВФормеПрочихДокументов(Объект, Форма, ПриСозданииФормыНаСервере, ИзмененКлиентКонтакт, ТипОбъекта, ЭтоНовый, СсылкаНаОснование, ЗаполнятьДоступными)

	Если ИзмененКлиентКонтакт Тогда

		Форма.CRM_ТаблицаИнтересов.Очистить();
		Форма.CRM_ИнтересСтрокой	= "";

		Если ТипОбъекта = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда

			// Входящее письмо
			Форма.CRM_Интерес_Клиент  = Справочники.Партнеры.ПустаяСсылка();
			Форма.CRM_Интерес_Контакт = Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка();

			Если ЗначениеЗаполнено(Объект.ОтправительКонтакт) Тогда
				Если ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.Партнеры") ИЛИ ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
					Форма.CRM_Интерес_Клиент = Объект.ОтправительКонтакт;
				ИначеЕсли ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
					Форма.CRM_Интерес_Клиент  = Объект.ОтправительКонтакт.Владелец;
					Форма.CRM_Интерес_Контакт = Объект.ОтправительКонтакт;
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда

			// Исходящее письмо
			Форма.CRM_Интерес_Клиент  = Справочники.Партнеры.ПустаяСсылка();
			Форма.CRM_Интерес_Контакт = Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка();

			Если ЗначениеЗаполнено(Форма._Партнер) Тогда
				Если ТипЗнч(Форма._Партнер) = Тип("СправочникСсылка.Партнеры") Тогда
					Форма.CRM_Интерес_Клиент = Форма._Партнер;
				КонецЕсли;

				Если ТипЗнч(Форма._Партнер) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
					Форма.CRM_Интерес_Клиент  = Форма._Партнер.Владелец;
					Форма.CRM_Интерес_Контакт = Форма._Партнер;
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда

			// Телефонный звонок
			Форма.CRM_Интерес_Клиент  = Справочники.Партнеры.ПустаяСсылка();
			Форма.CRM_Интерес_Контакт = Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка();

			Если ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
				Если ТипЗнч(Объект.АбонентКонтакт) = Тип("СправочникСсылка.Партнеры") Тогда
					Форма.CRM_Интерес_Клиент	= Объект.АбонентКонтакт;
				ИначеЕсли ТипЗнч(Объект.АбонентКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
					Форма.CRM_Интерес_Клиент	= Объект.АбонентКонтакт.Владелец;
					Форма.CRM_Интерес_Контакт	= Объект.АбонентКонтакт;
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.CRM_Заявка") Тогда

			// Заявка
			Если Форма.CRM_Интерес_Клиент  <> Объект.Контакт Тогда
				Форма.CRM_Интерес_Клиент  = Объект.Контакт;
			КонецЕсли;

		Иначе

			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Партнер") Тогда
				РеквизитПартнер = Объект["Партнер"];
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Клиент") Тогда
				РеквизитПартнер = Объект["Клиент"];
			Иначе
				РеквизитПартнер = Неопределено;
			КонецЕсли;
			Если Не РеквизитПартнер = Неопределено Тогда
				Если Форма.CRM_Интерес_Клиент  <> РеквизитПартнер Тогда
					Форма.CRM_Интерес_Клиент  = РеквизитПартнер;
					Форма.CRM_Интерес_Контакт = Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Если ПриСозданииФормыНаСервере Тогда

		Если ТипОбъекта = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда

			// Входящее письмо
			Форма.CRM_Интерес_Клиент  = Справочники.Партнеры.ПустаяСсылка();
			Форма.CRM_Интерес_Контакт = Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка();

			Если ЗначениеЗаполнено(Объект.ОтправительКонтакт) Тогда
				Если ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.Партнеры") ИЛИ ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
					Форма.CRM_Интерес_Клиент = Объект.ОтправительКонтакт;
				ИначеЕсли ТипЗнч(Объект.ОтправительКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
					Форма.CRM_Интерес_Клиент  = Объект.ОтправительКонтакт.Владелец;
					Форма.CRM_Интерес_Контакт = Объект.ОтправительКонтакт;
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда

			// Исходящее письмо
			Форма.CRM_Интерес_Клиент  = Справочники.Партнеры.ПустаяСсылка();
			Форма.CRM_Интерес_Контакт = Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка();

			Если ЗначениеЗаполнено(Форма._Партнер) Тогда
				Если ТипЗнч(Форма._Партнер) = Тип("СправочникСсылка.Партнеры") Тогда
					Форма.CRM_Интерес_Клиент = Форма._Партнер;
				КонецЕсли;

				Если ТипЗнч(Форма._Партнер) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
					Форма.CRM_Интерес_Клиент  = Форма._Партнер.Владелец;
					Форма.CRM_Интерес_Контакт = Форма._Партнер;
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда

			// Телефонный звонок
			Форма.CRM_Интерес_Клиент  = Справочники.Партнеры.ПустаяСсылка();
			Форма.CRM_Интерес_Контакт = Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка();

			Если ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
				Если ТипЗнч(Объект.АбонентКонтакт) = Тип("СправочникСсылка.Партнеры") Тогда
					Форма.CRM_Интерес_Клиент	= Объект.АбонентКонтакт;
				ИначеЕсли ТипЗнч(Объект.АбонентКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
					Форма.CRM_Интерес_Клиент	= Объект.АбонентКонтакт.Владелец;
					Форма.CRM_Интерес_Контакт	= Объект.АбонентКонтакт;
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Документы", "CRM_СчетНаОплатуПокупателю")
			И ТипОбъекта = Тип("ДокументСсылка." + "CRM_СчетНаОплатуПокупателю") Тогда

			// Счет на оплату
			Форма.CRM_Интерес_Клиент  = Объект.Партнер;
			Форма.CRM_Интерес_Контакт = Объект.КонтактноеЛицо;

		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.CRM_Заявка") Тогда

			// Заявка
			Форма.CRM_Интерес_Клиент  = Объект.Контакт;

		Иначе

			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Партнер") Тогда
				Форма.CRM_Интерес_Клиент  = Объект.Партнер;
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Клиент") Тогда
				Форма.CRM_Интерес_Клиент  = Объект.Клиент;
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "КонтактноеЛицо") Тогда
				Форма.CRM_Интерес_Контакт = Объект.КонтактноеЛицо;
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;

	Если  НЕ ЗначениеЗаполнено(СсылкаНаОснование) Тогда
		ИмяРеквизитаОснования	= CRM_ОбщегоНазначенияСервер.ВернутьИмяРеквизитаОснования(ТипОбъекта);
		Если НЕ ИмяРеквизитаОснования = Неопределено И ЗначениеЗаполнено(Объект[ИмяРеквизитаОснования]) Тогда
			СсылкаНаОснование	= Объект[ИмяРеквизитаОснования];
		КонецЕсли;
	КонецЕсли;

	// Вторая попытка проверить заполненность основания для исходящих писем.
	Если Не ЗначениеЗаполнено(СсылкаНаОснование) И ТипОбъекта = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		ИмяРеквизитаОснования = "ВзаимодействиеОснование";
		Если ЗначениеЗаполнено(Объект[ИмяРеквизитаОснования]) Тогда
			СсылкаНаОснование = Объект[ИмяРеквизитаОснования];
		КонецЕсли;
	КонецЕсли;

	Если ПриСозданииФормыНаСервере И ЭтоНовый Тогда
		ЕстьИнтересы = Ложь;

		Если НЕ СсылкаНаОснование = Неопределено Тогда
			Если ТипЗнч(СсылкаНаОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда

				Форма.ЕстьИнтересыДляВыбора	= Истина;
				Форма.CRM_ИнтересСтрокой		= СформироватьПредставлениеИнтересаСтрокой(СсылкаНаОснование);

				Форма.Элементы.CRM_ИнтересСтрокой.ТолькоПросмотр = Истина;

				НоваяСтрока = Форма.CRM_ТаблицаИнтересов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СсылкаНаОснование);
				НоваяСтрока.ВведенНаОсновании = Истина;

				// Форма.Элементы.CRM_ИнтересСтрокой.КнопкаВыбора	= Ложь;
				Форма.Элементы.CRM_ИнтересСтрокой.КнопкаВыбора	= Истина;
				Форма.Элементы.CRM_ИнтересСтрокой.КнопкаОчистки	= Ложь;

				ЕстьИнтересы = Истина;
			ИначеЕсли ТипЗнч(СсылкаНаОснование) = Тип("ДокументСсылка.CRM_Взаимодействие")
				И ЗначениеЗаполнено(СсылкаНаОснование.ДокументОснование) Тогда

				Форма.ЕстьИнтересыДляВыбора	= Истина;
				Форма.CRM_ИнтересСтрокой		= СформироватьПредставлениеИнтересаСтрокой(СсылкаНаОснование.ДокументОснование);

				Форма.Элементы.CRM_ИнтересСтрокой.ТолькоПросмотр = Истина;

				НоваяСтрока = Форма.CRM_ТаблицаИнтересов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СсылкаНаОснование.ДокументОснование);
				НоваяСтрока.ВведенНаОсновании = Истина;

				// Форма.Элементы.CRM_ИнтересСтрокой.КнопкаВыбора	= Ложь;
				Форма.Элементы.CRM_ИнтересСтрокой.КнопкаВыбора	= Истина;
				Форма.Элементы.CRM_ИнтересСтрокой.КнопкаОчистки	= Ложь;

				ЕстьИнтересы = Истина;
			Иначе
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Объект",СсылкаНаОснование);
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	CRM_ЖурналДокументов.CRM_Интерес КАК Ссылка,
				|	CRM_ЖурналДокументов.СостояниеИнтереса,
				|	CRM_ЖурналДокументов.ОсновнойИнтерес КАК ОсновнойИнтерес,
				|	CRM_ЖурналДокументов.ИнтересЯвляетсяОснованием КАК ВведенНаОсновании
				|ИЗ
				|	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
				|ГДЕ
				|	CRM_ЖурналДокументов.Объект = &Объект
				|	И НЕ CRM_ЖурналДокументов.CRM_Интерес = ЗНАЧЕНИЕ(Документ.CRM_Интерес.ПустаяСсылка)
				|	И CRM_ЖурналДокументов.ГлавнаяЗапись
				|
				|УПОРЯДОЧИТЬ ПО
				|	ОсновнойИнтерес УБЫВ";

				Выборка = Запрос.Выполнить().Выбрать();

				Пока Выборка.Следующий() Цикл
					НоваяСтрока = Форма.CRM_ТаблицаИнтересов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка.Ссылка);
					НоваяСтрока.ВведенНаОсновании	= Выборка.ВведенНаОсновании;
					НоваяСтрока.ОсновнойИнтерес		= Выборка.ОсновнойИнтерес;
					ЕстьИнтересы = Истина;
				КонецЦикла;

				Если (Форма.CRM_ТаблицаИнтересов.Количество() > 0) Тогда
					Форма.ЕстьИнтересыДляВыбора	= Истина;
					Форма.CRM_ИнтересСтрокой	= СформироватьПредставлениеИнтересаСтрокой(Форма.CRM_ТаблицаИнтересов[0].Ссылка);

					Форма.Элементы.CRM_ИнтересСтрокой.ТолькоПросмотр = Форма.CRM_ТаблицаИнтересов[0].ВведенНаОсновании;
					Форма.Элементы.CRM_ИнтересСтрокой.КнопкаОчистки	 = Не Форма.CRM_ТаблицаИнтересов[0].ВведенНаОсновании;
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли НЕ ЕстьИнтересы Тогда

			Если ЗначениеЗаполнено(Форма.CRM_Интерес_Клиент) Тогда
				ПарамПартнер = Форма.CRM_Интерес_Клиент;
				ПарамКонтакт = Форма.CRM_Интерес_Контакт;

				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Партнер"				,ПарамПартнер);
				Запрос.УстановитьПараметр("КонтактноеЛицо"		,ПарамКонтакт);

				ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	CRM_Интерес.Ссылка
				|ИЗ
				|	Документ.CRM_Интерес КАК CRM_Интерес
				|ГДЕ
				|	CRM_Интерес.Партнер = &Партнер
				|	И НЕ CRM_Интерес.Завершен";
				Если ЗначениеЗаполнено(ПарамКонтакт) Тогда
					ТекстЗапроса = ТекстЗапроса + "
					|	И CRM_Интерес.КонтактноеЛицо = &КонтактноеЛицо";
				КонецЕсли;
				ТекстЗапроса = ТекстЗапроса + "
				|	И НЕ CRM_Интерес.ПометкаУдаления";

				Запрос.Текст = ТекстЗапроса;
				
				#Удаление //++ #1926 смарт: Фролов 16.07.2024 //Запрет подставления незавершенного интереса при создании/копировании Заказа клиента
				Выборка = Запрос.Выполнить().Выбрать();

				Если Выборка.Следующий() Тогда
					Форма.ЕстьИнтересыДляВыбора = Истина;

					Если Выборка.Количество() = 1 Тогда
						Форма.CRM_ИнтересСтрокой	= СформироватьПредставлениеИнтересаСтрокой(Выборка.Ссылка);
						НоваяСтрока = Форма.CRM_ТаблицаИнтересов.Вставить(0);
						ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка.Ссылка);
					КонецЕсли;
				КонецЕсли;
				#КонецУдаления
				
			КонецЕсли;
		КонецЕсли;
		// Если интересов никаких не нашли, то поле с основным интересом оставляем пустым, 
		// при этом таблица интересов тоже будет пустой.
		Если НЕ ЕстьИнтересы Тогда
			// Включаем видимость группы интерес.
			Форма.ЕстьИнтересыДляВыбора = Истина;
		КонецЕсли;				
	КонецЕсли;

	// Работа с таблицей интересов.
	Если ПриСозданииФормыНаСервере И НЕ ЭтоНовый Тогда

		// В начале проверим, не связан ли документ с интересами
		// данные берем из регистра "CRM_ЖурналДокументов" и рекизита "CRM_Интерес".

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Объект", Объект.Ссылка);

		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	CRM_ЖурналДокументов.CRM_Интерес КАК Ссылка,
		|	CRM_ЖурналДокументов.ИнтересЯвляетсяОснованием КАК ВведенНаОсновании,
		|	CRM_ЖурналДокументов.ОсновнойИнтерес
		|ИЗ
		|	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
		|ГДЕ
		|	CRM_ЖурналДокументов.Объект = &Объект
		|	И НЕ CRM_ЖурналДокументов.CRM_Интерес = ЗНАЧЕНИЕ(Документ.CRM_Интерес.ПустаяСсылка)
		|	И CRM_ЖурналДокументов.ГлавнаяЗапись";
		ТекстЗапроса = ТекстЗапроса + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОсновнойИнтерес УБЫВ";

		Запрос.Текст = ТекстЗапроса;

		Выборка = Запрос.Выполнить().Выбрать();

		ЕстьИнтересы = Ложь;

		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Форма.CRM_ТаблицаИнтересов.Добавить();
			Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка.Ссылка);
				НоваяСтрока.ВведенНаОсновании	= Выборка.ВведенНаОсновании;
				НоваяСтрока.ОсновнойИнтерес		= Выборка.ОсновнойИнтерес;
				ЕстьИнтересы = Истина;
			КонецЕсли;
		КонецЦикла;

		Если (Форма.CRM_ТаблицаИнтересов.Количество() > 0) Тогда
			Форма.ЕстьИнтересыДляВыбора	= Истина;
			ТекСтрокаИнтерес = Форма.CRM_ТаблицаИнтересов[0];
			Форма.CRM_ИнтересСтрокой	= СформироватьПредставлениеИнтересаСтрокой(ТекСтрокаИнтерес.Ссылка);
			Форма.Элементы.CRM_ИнтересСтрокой.ТолькоПросмотр = Форма.CRM_ТаблицаИнтересов[0].ВведенНаОсновании;
		КонецЕсли;

		// Если документ никак не связан с интересами, то подставим
		// доступный интерес, также как и в случае с новым документом.
		Если НЕ ЕстьИнтересы И ЗаполнятьДоступными Тогда

			НастройкиСвязи = РегистрыСведений.CRM_НастройкиСвязиОбращенийСИнтересами.НастройкиСвязиОбращенийСИнтересами(Объект.Ссылка);
			Если НастройкиСвязи.Связывать И ЗначениеЗаполнено(Форма.CRM_Интерес_Клиент) Тогда

				СвязыватьСоВсеми = (НастройкиСвязи.РежимСвязи = Перечисления.CRM_РежимыСвязиОбращенияСИнтересами.СвязыватьСоВсеми);
				СвязыватьСПоследним = (НастройкиСвязи.РежимСвязи = Перечисления.CRM_РежимыСвязиОбращенияСИнтересами.СвязыватьСПоследним);

				ПарамПартнер = Форма.CRM_Интерес_Клиент;
				ПарамКонтакт = Форма.CRM_Интерес_Контакт;

				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Дата"				,Объект.Дата);
				Запрос.УстановитьПараметр("Партнер"				,ПарамПартнер);
				Запрос.УстановитьПараметр("КонтактноеЛицо"		,ПарамКонтакт);

				ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	CRM_Интерес.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.CRM_Интерес КАК CRM_Интерес
				|ГДЕ
				|	CRM_Интерес.Партнер = &Партнер
				|	И НЕ CRM_Интерес.Завершен
				|	И НЕ CRM_Интерес.Дата < &Дата
				|	И НЕ CRM_Интерес.ПометкаУдаления";
				Если ЗначениеЗаполнено(ПарамКонтакт) Тогда
					ТекстЗапроса = ТекстЗапроса + "
					|	И CRM_Интерес.КонтактноеЛицо = &КонтактноеЛицо";
				КонецЕсли;
				Если СвязыватьСПоследним Тогда
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1");
					ТекстЗапроса = ТекстЗапроса + "
					|УПОРЯДОЧИТЬ ПО
					|	CRM_Интерес.Ссылка.Дата УБЫВ";
				КонецЕсли;

				Запрос.Текст = ТекстЗапроса;

				Выборка = Запрос.Выполнить().Выбрать();

				Если Выборка.Количество() > 0 Тогда
					Если СвязыватьСоВсеми ИЛИ Выборка.Количество() = 1 Тогда
						Форма.ЕстьИнтересыДляВыбора = Истина;
						Пока Выборка.Следующий() Цикл
							НоваяСтрока = Форма.CRM_ТаблицаИнтересов.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка.Ссылка);
						КонецЦикла;
						Форма.CRM_ИнтересСтрокой = СформироватьПредставлениеИнтересаСтрокой(НоваяСтрока.Ссылка);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// Если интересов никаких не нашли, то поле с основным интересом оставляем пустым, 
		// при этом таблица интересов тоже будет пустой.
		Если НЕ ЕстьИнтересы Тогда
			// Включаем видимость группы интерес.
			Форма.ЕстьИнтересыДляВыбора = Истина;
		КонецЕсли;				
	КонецЕсли;

	Если ИзмененКлиентКонтакт Тогда
		ЕстьИнтересы = Ложь;

		// В начале проверим, не связан ли документ с интересами
		// данные берем из таблицы значений CRM_ТаблицаИнтересов, т.к. документ может быть еще не записан
		// если связан, то не важно уже есть ли вообще клиенты.

		Если Форма.CRM_ТаблицаИнтересов.Количество() > 0 Тогда
			Форма.ЕстьИнтересыДляВыбора	= Истина;
			ЕстьИнтересы				= Истина;
			Форма.CRM_ИнтересСтрокой	= СформироватьПредставлениеИнтересаСтрокой(Форма.CRM_ТаблицаИнтересов[0].Ссылка);
		КонецЕсли;

		Если НЕ ЕстьИнтересы И ЗначениеЗаполнено(Форма.CRM_Интерес_Клиент) Тогда

			ПарамПартнер = Форма.CRM_Интерес_Клиент;
			ПарамКонтакт = Форма.CRM_Интерес_Контакт;

			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Партнер"				,ПарамПартнер);
			Запрос.УстановитьПараметр("КонтактноеЛицо"		,ПарамКонтакт);

			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	CRM_Интерес.Ссылка
			|ИЗ
			|	Документ.CRM_Интерес КАК CRM_Интерес
			|ГДЕ
			|	CRM_Интерес.Партнер = &Партнер
			|	И НЕ CRM_Интерес.Завершен";
			Если ЗначениеЗаполнено(Форма.CRM_Интерес_Контакт) Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И CRM_Интерес.КонтактноеЛицо = &КонтактноеЛицо";
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса + "
			|	И НЕ CRM_Интерес.ПометкаУдаления";

			Запрос.Текст = ТекстЗапроса;

			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Следующий() Тогда

				Форма.ЕстьИнтересыДляВыбора = Истина;
				ЕстьИнтересы				= Истина;

				Если Выборка.количество() = 1 Тогда
					Если Форма.CRM_ТаблицаИнтересов.Количество() = 0 Тогда
						Форма.CRM_ИнтересСтрокой	= СформироватьПредставлениеИнтересаСтрокой(Выборка.Ссылка);
						НоваяСтрока					= Форма.CRM_ТаблицаИнтересов.Вставить(0);
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка.Ссылка);
					Иначе
						МассивСтрок = Форма.CRM_ТаблицаИнтересов.НайтиСтроки(Новый Структура("Ссылка",Выборка.Ссылка));
						Если МассивСтрок.Количество() = 0 Тогда
							НоваяСтрока = Форма.CRM_ТаблицаИнтересов.Вставить(0);
							ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка.Ссылка);
						Иначе
							Форма.CRM_ТаблицаИнтересов.Сдвинуть(Форма.CRM_ТаблицаИнтересов.Индекс(МассивСтрок[0]),-Форма.CRM_ТаблицаИнтересов.Индекс(МассивСтрок[0]));
						КонецЕсли;

						Форма.CRM_ИнтересСтрокой = СформироватьПредставлениеИнтересаСтрокой(Выборка.Ссылка);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// Если интересов никаких не нашли, то поле с основным интересом оставляем пустым, 
		// при этом таблица интересов тоже будет пустой.
		Если НЕ ЕстьИнтересы Тогда
			// Включаем видимость группы интерес.
			Форма.ЕстьИнтересыДляВыбора = Истина;
		КонецЕсли;
	КонецЕсли;


КонецПроцедуры //-- #1926 смарт: Фролов 16.07.2024

#КонецОбласти
